import java.util.Scanner;

public class TaskSeven {
    //TODO Проверка на простое число
    // Напишите программу, которая проверяет, является ли число, введенное пользователем, простым
    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);
        System.out.println("Enter number: ");
        int number = scanner.nextInt();
    }
}
